// JavaScript Document
var gwq=[
//红乌龟的参数
hwg={
	ol:0,   //红乌龟的编号
	tx:0,   //红乌龟在图片是的开始x坐标
	ty:0,   //红乌龟在图片的开始y坐标
	tw:34,  //红乌龟在图片的开始坐标到结束坐标的宽度
	th:53,  //红乌龟在图片的开始坐标到结束坐标的高度
	cx:50,	//红乌龟在画布上x坐标
	cy:291, //红乌龟在画布上y坐标
	cw:34,  //红乌龟在画布上的宽度
	ch:53,  //红乌龟在画布上的高度
	vx:3,   //红乌龟在x坐标的移动速度
	vy:0,   //红乌龟在y坐标的移动速度
	gs:0,   //红乌龟的计数器
	sv:34,  //红乌龟在图片上的宽度
	zt:true //红乌龟的状态（是否在运动）	
},
//绿乌龟的参数
lwg={
	ol:1,   //绿乌龟的编号
	tx:0,   //绿乌龟在图片是的开始x坐标
	ty:63,  //绿乌龟在图片的开始y坐标
	tw:34,  //绿乌龟在图片的开始坐标到结束坐标的宽度
	th:53,  //绿乌龟在图片的开始坐标到结束坐标的高度
	cx:50,	//绿乌龟在画布上x坐标
	cy:291, //绿乌龟在画布上y坐标
	cw:34,  //绿乌龟在画布上的宽度
	ch:53,  //绿乌龟在画布上的高度
	vx:3,   //绿乌龟在x坐标的移动速度
	vy:0,   //绿乌龟在y坐标的移动速度
	gs:0,   //绿乌龟的计数器
	sv:34,  //绿乌龟在图片上的宽度
	zt:true //绿乌龟的状态（是否在运动）	
},
//褐色牛牛的参数
hnn={
	ol:2,   //褐色牛牛的编号
	tx:0,   //褐色牛牛在图片是的开始x坐标
	ty:148, //褐色牛牛在图片的开始y坐标
	tw:32,  //褐色牛牛在图片的开始坐标到结束坐标的宽度
	th:33,  //褐色牛牛在图片的开始坐标到结束坐标的高度
	cx:50,	//褐色牛牛在画布上x坐标
	cy:291, //褐色牛牛在画布上y坐标
	cw:32,  //褐色牛牛在画布上的宽度
	ch:33,  //褐色牛牛在画布上的高度
	vx:3,   //褐色牛牛在x坐标的移动速度
	vy:0,   //褐色牛牛在y坐标的移动速度
	gs:0,   //褐色牛牛的计数器
	sv:32,  //褐色牛牛在图片上的宽度
	zt:true //褐色牛牛的状态（是否在运动）	
},
//刺猬的参数
cw={
	ol:3,   //刺猬的编号
	tx:0,   //刺猬在图片是的开始x坐标
	ty:212, //刺猬在图片的开始y坐标
	tw:32,  //刺猬在图片的开始坐标到结束坐标的宽度
	th:33,  //刺猬在图片的开始坐标到结束坐标的高度
	cx:50,	//刺猬在画布上x坐标
	cy:291, //刺猬在画布上y坐标
	cw:32,  //刺猬在画布上的宽度
	ch:33,  //刺猬在画布上的高度
	vx:3,   //刺猬在x坐标的移动速度
	vy:0,   //刺猬在y坐标的移动速度
	gs:0,   //刺猬的计数器
	sv:32,  //刺猬在图片上的宽度
	zt:true //刺猬的状态（是否在运动）	
}];